In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']}
countries = pd.DataFrame(data)
countries = countries.set_index('country') # 인덱스 지정
countries

                population    area    capital
country
Belgium               11.3   30510   Brussels
France                64.3  671308      Paris
Germany               81.3  357050     Berlin
Netherlands           16.9   41526  Amsterdam
United Kingdom        64.9  244820     London

In [3]:
countries.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Belgium to United Kingdom
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  5 non-null      float64
 1   area        5 non-null      int64
 2   capital     5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [4]:
#문제1

In [5]:
density = (countries['population'] * 1000000)/countries['area']

In [6]:
countries['density'] = density

In [7]:
countries

                population    area    capital     density
country
Belgium               11.3   30510   Brussels  370.370370
France                64.3  671308      Paris   95.783158
Germany               81.3  357050     Berlin  227.699202
Netherlands           16.9   41526  Amsterdam  406.973944
United Kingdom        64.9  244820     London  265.092721

In [8]:
# 문제2 인구밀도가 300을 초과하는 국가(country)의 수도(capital)과 인구(population)을 선택해주세요.

In [9]:
countries[countries['density'] > 300]

             population   area    capital     density
country
Belgium            11.3  30510   Brussels  370.370370
Netherlands        16.9  41526  Amsterdam  406.973944

In [10]:
#문제3 density_ratio 칼럼을 추가해주세요. (density_ratio = 인구밀도/평균 인구밀도)
density_ratio = density/density.mean()
density_ratio

country
Belgium           1.355755
France            0.350618
Germany           0.833502
Netherlands       1.489744
United Kingdom    0.970382
dtype: float64

In [11]:
#문제4 영국(United Kingdom)의 수도(capital)를 'Cambridge'로 변경해주세요.
countries['capital']['United Kingdom'] = 'Cambridge'
countries

C:\Users\Admin\AppData\Local\Temp\ipykernel_18004\303175117.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  countries['capital']['United Kingdom'] = 'Cambridge'
C:\Users\Admin\AppData\Local\Temp\ipykernel_18004\303175117.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  countries['capital']['United Kingdom'] = 'Cambridge'

                population    area    capital     density
country
Belgium               11.3   30510   Brussels  370.370370
France                64.3  671308      Paris   95.783158
Germany               81.3  357050     Berlin  227.699202
Netherlands           16.9   41526  Amsterdam  406.973944
United Kingdom        64.9  244820  Cambridge  265.092721

In [12]:
#문제5 인구 밀도가 100 초과, 300 미만인 국가들을 표시해주세요.

In [13]:
countries[(100 < countries['density']) & (countries['density'] < 300)]

                population    area    capital     density
country
Germany               81.3  357050     Berlin  227.699202
United Kingdom        64.9  244820  Cambridge  265.092721

In [14]:
#문제6 수도가 7글자 이상인 국가들을 표시해주세요
for i in countries['capital']:
    if len(i) >= 7:
        print(i)

Brussels
Amsterdam
Cambridge

In [15]:
#문제7 수도에'am'이 포함되는 국가들을 표시해주세요
countries['capital'].str.contains('am')

country
Belgium           False
France            False
Germany           False
Netherlands        True
United Kingdom     True
Name: capital, dtype: bool

# 영화리뷰 데이터에서 자료 찾기

In [16]:
titles = pd.read_csv("./data/movie_title_data.tsv", sep='\t')

C:\Users\Admin\AppData\Local\Temp\ipykernel_18004\3775869459.py:1: DtypeWarning: Columns (4,5) have mixed types. Specify dtype option on import or set low_memory=False.
  titles = pd.read_csv("./data/movie_title_data.tsv", sep='\t')

In [17]:
titles['startYear'] = titles['startYear'].replace("\\N", np.nan).astype("float16")
titles['startYear']

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

0          1894.0
1          1892.0
2          1892.0
3          1892.0
4          1893.0
            ...
8407394    2010.0
8407395    2010.0
8407396    2010.0
8407397    2015.0
8407398    2014.0
Name: startYear, Length: 8407399, dtype: float16

In [18]:
titles

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892.0,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893.0,\N,1,"Comedy,Short"
...,...,...,...,...,...,...,...,...,...
8407394,tt9916848,tvEpisode,Episode #3.17,Episode #3.17,0,2010.0,\N,\N,"Action,Drama,Family"
8407395,tt9916850,tvEpisode,Episode #3.19,Episode #3.19,0,2010.0,\N,\N,"Action,Drama,Family"
8407396,tt9916852,tvEpisode,Episode #3.20,Episode #3.20,0,2010.0,\N,\N,"Action,Drama,Family"
8407397,tt9916856,short,The Wind,The Wind,0,2015.0,\N,27,Short
8407398,tt9916880,tvEpisode,Horrid Henry Knows It All,Horrid Henry Knows It All,0,2014.0,\N,10,"Adventure,Animation,Comedy"

In [19]:
#문제8 titles 데이터 프레임에는 몇개의 영화가 기록되어 있나요?
len(titles['tconst'])

8407399

In [20]:
#문제9 titles에서 가장 빠른 시기에 제작된 두 개를 표시하시요.
titles.sort_values(by = 'startYear').head(2)

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
5329521,tt3155794,short,Passage de Venus,Passage de Venus,0,1874.0,\N,1,"Documentary,Short"
3488807,tt14495706,short,La Rosace Magique,La Rosace Magique,0,1877.0,\N,1,"Animation,Short"

In [21]:
#문제10 제목이 Hamlet인 영화는 몇 개가 있나요?
titles[titles['originalTitle'].str.contains("Hamlet", na=False)]

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
303,tt0000306,short,Le duel d'Hamlet,Le duel d'Hamlet,0,1900.0,\N,2,"Drama,Short"
594,tt0000598,short,"Hamlet, Prince of Denmark",Hamlet,0,1907.0,\N,10,"Drama,Short"
876,tt0000886,movie,"Hamlet, Prince of Denmark",Hamlet,0,1910.0,\N,\N,Drama
1228,tt0001240,movie,Hamlet,Hamlet,0,1911.0,\N,\N,Drama
1229,tt0001241,short,Hamlet,Hamlet,0,1910.0,\N,20,"Drama,Short"
...,...,...,...,...,...,...,...,...,...
8114427,tt9297654,video,Ten Deaths of Hamlet,Ten Deaths of Hamlet,0,2018.0,\N,\N,Drama
8182008,tt9440248,movie,Hamlet Shakespeare's Globe,Hamlet Shakespeare's Globe,0,2018.0,\N,154,Drama
8235329,tt9553644,tvEpisode,Hamlet Stanislawa Wyspianskiego,Hamlet Stanislawa Wyspianskiego,0,2008.0,\N,63,Drama
8306453,tt9703966,movie,Hamlet,Hamlet,0,NaN,\N,\N,Drama
8400053,tt9901352,movie,Hamlet Poem Unlimited,Hamlet Poem Unlimited,0,2018.0,\N,60,Drama

In [22]:
#문제11 제목이Treasure Island인 영화를 제작년도의 오름차순에 따라 표시하세요
titles[titles['originalTitle'].str.contains("Treasure Island", na=False)].sort_values(by="startYear", ascending=True)

C:\Users\Admin\miniforge3\envs\fintech\lib\site-packages\pandas\io\formats\format.py:1458: RuntimeWarning: overflow encountered in cast
  has_large_values = (abs_vals > 1e6).any()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
4517005,tt1862121,short,The Story of Treasure Island,The Story of Treasure Island,0,1908.0,\N,\N,"Drama,Short"
2511,tt0002538,short,Treasure Island,Treasure Island,0,1912.0,\N,\N,"Adventure,Short"
5032142,tt2440348,short,Treasure Island,Treasure Island,0,1913.0,\N,\N,"Short,Thriller"
9589,tt0009721,movie,Treasure Island,Treasure Island,0,1917.0,\N,60,Adventure
11620,tt0011785,movie,Treasure Island,Treasure Island,0,1920.0,\N,76,Adventure
...,...,...,...,...,...,...,...,...,...
5580075,tt3735542,movie,Silver's Gold: A Return to Treasure Island,Silver's Gold: A Return to Treasure Island,0,NaN,\N,\N,Adventure
6981232,tt6870206,short,Untitled Treasure Island Project,Untitled Treasure Island Project,0,NaN,\N,\N,Short
7424209,tt7821704,tvEpisode,The Real Treasure Island,The Real Treasure Island,0,NaN,\N,21,"Adventure,Documentary"
7838572,tt8709864,tvSeries,Treasure Island,Treasure Island,0,NaN,\N,\N,Reality-TV
8273694,tt9635212,tvEpisode,Treasure Island/Cat's Short Cut,Treasure Island/Cat's Short Cut,0,NaN,\N,\N,\N

# 타이타닉 자료에서 그룹별 연산하기

In [159]:
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [160]:
#원격 DB에 접속해서 titanic 데이터베이스 안에 있는 p_info, t_info, survived 테이블을 불러와 합치고 아래의 문제를 풀어보세요.
engine = create_engine("mysql+pymysql://kict04:kict04@221.155.18.165:3306/titanic")
conn = engine.connect()
p_info = pd.read_sql("p_info",con=conn)
t_info = pd.read_sql("t_info",con=conn)
survived = pd.read_sql("survived",con=conn)
conn.close()

In [161]:
titanic = pd.merge(p_info,t_info,how='left',on='PassengerId')
titanic_sum = pd.merge(titanic,survived,how='left',on='PassengerId')
titanic_sum

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

In [162]:
#문제13 데이터의 상위 5개 행을 출력하세요
titanic_sum.head(5)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0

In [163]:
#문제14 데이터의 정보를 출력하세요
titanic_sum.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   SibSp        891 non-null    int64
 5   Parch        891 non-null    int64
 6   Ticket       891 non-null    object
 7   Pclass       891 non-null    int64
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [164]:
#문제15 데이터의 기술통계를 확인하세요
titanic_sum.describe()

,PassengerId,Age,SibSp,Parch,Pclass,Fare,Survived
count,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,29.699118,0.523008,0.381594,2.308642,32.204208,0.383838
std,257.353842,14.526497,1.102743,0.806057,0.836071,49.693429,0.486592
min,1.000000,0.420000,0.000000,0.000000,1.000000,0.000000,0.000000
25%,223.500000,20.125000,0.000000,0.000000,2.000000,7.910400,0.000000
50%,446.000000,28.000000,0.000000,0.000000,3.000000,14.454200,0.000000
75%,668.500000,38.000000,1.000000,0.000000,3.000000,31.000000,1.000000
max,891.000000,80.000000,8.000000,6.000000,3.000000,512.329200,1.000000

In [165]:
#문제16 처음 100명의 데이터를 출력하시요
titanic_sum.head(100)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,3,8.0500,None,S,0
96,97,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,1,34.6542,A5,C,0
97,98,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,1,63.3583,D10 D12,C,1
98,99,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,2,23.0000,None,S,1
99,100,"Kantor, Mr. Sinai",male,34.0,1,0,244367,2,26.0000,None,S,0

In [166]:
#문제17 인덱스가 10~20인 데이터를 출력하세요.
titanic_sum[10:21]

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,3,16.7000,G6,S,1
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,1,26.5500,C103,S,1
12,13,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,3,8.0500,None,S,0
13,14,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,3,31.2750,None,S,0
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,3,7.8542,None,S,0
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,2,16.0000,None,S,1
16,17,"Rice, Master. Eugene",male,2.0,4,1,382652,3,29.1250,None,Q,0
17,18,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,2,13.0000,None,S,1
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,3,18.0000,None,S,0
19,20,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,3,7.2250,None,C,1
20,21,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,2,26.0000,None,S,0

In [167]:
#문제 컬럼이름을 모두 출력하세요
titanic_sum.columns

Index(['PassengerId', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Pclass', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [168]:
#문제18 데이터의 shape를 확인하세요
titanic_sum.shape

(891, 12)

In [169]:
#문제19 Age컬럼의 평균을 구하세요.
titanic_sum['Age'].mean()

np.float64(29.69911764705882)

In [170]:
#문제20 Survived 컬럼의 고유값을 확인하세요
titanic_sum['Survived'].unique()

array([0, 1])

In [171]:
#문제21 나이가 30이상인 승객만 출력하세요.
titanic_sum[titanic_sum['Age']>=30]

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,1,51.8625,E46,S,0
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,1,26.5500,C103,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,3,9.0000,None,S,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,1,83.1583,C50,C,1
881,882,"Markun, Mr. Johann",male,33.0,0,0,349257,3,7.8958,None,S,0
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,3,29.1250,None,Q,0
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0

In [172]:
#문제22 성별이 'female'이고 생존한 승객만 출력하세요.
titanic_sum[(titanic_sum['Sex']=='female')&(titanic_sum['Survived'] == 1)]

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,3,11.1333,None,S,1
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,2,30.0708,None,C,1
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,2,24.0000,None,C,1
875,876,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,3,7.2250,None,C,1
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,1,83.1583,C50,C,1
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,2,26.0000,None,S,1
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1

In [173]:
#문제23 나이가 10살 이하이고 요금이 20이상인 승객을 출력하세요
titanic_sum[(titanic_sum['Age']>=10)&(titanic_sum['Fare'] >= 20)]

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,1,51.8625,E46,S,0
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,2,30.0708,None,C,1
11,12,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,1,26.5500,C103,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,1,83.1583,C50,C,1
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,2,26.0000,None,S,1
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,3,29.1250,None,Q,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1

In [174]:
#문제24 나이가 결측치인 데이터를 출력하세요.
titanic_sum[titanic_sum['Age'].isna()]

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
5,6,"Moran, Mr. James",male,NaN,0,0,330877,3,8.4583,None,Q,0
17,18,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,2,13.0000,None,S,1
19,20,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,3,7.2250,None,C,1
26,27,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,3,7.2250,None,C,0
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,3,7.8792,None,Q,1
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,"Razi, Mr. Raihed",male,NaN,0,0,2629,3,7.2292,None,C,0
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,3,69.5500,None,S,0
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,3,9.5000,None,S,0
878,879,"Laleff, Mr. Kristo",male,NaN,0,0,349217,3,7.8958,None,S,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0

In [175]:
#문제25 나이를 기준으로 오름차순 정렬하세요.
titanic_sum.sort_values(by='Age')

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
803,804,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,3,8.5167,None,C,1
755,756,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,2,14.5000,None,S,1
469,470,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,3,19.2583,None,C,1
644,645,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,3,19.2583,None,C,1
78,79,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,2,29.0000,None,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,"Razi, Mr. Raihed",male,NaN,0,0,2629,3,7.2292,None,C,0
863,864,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,3,69.5500,None,S,0
868,869,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,3,9.5000,None,S,0
878,879,"Laleff, Mr. Kristo",male,NaN,0,0,349217,3,7.8958,None,S,0
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0

In [176]:
#문제26 요금을 기준으로 내림차순 정렬하고 상위5명만 출력하세요.
titanic_sum.sort_values(by='Fare',ascending=False).head()

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived
737,738,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,1,512.3292,B101,C,1
679,680,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,1,512.3292,B51 B53 B55,C,1
258,259,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,1,512.3292,None,C,1
438,439,"Fortune, Mr. Mark",male,64.0,1,4,19950,1,263.0000,C23 C25 C27,S,0
88,89,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,1,263.0000,C23 C25 C27,S,1

In [177]:
#문제27 성별로 그룹화하여 생존률 평균을 구하세요.
titanic_sum[['Sex','Survived']].groupby(['Sex']).mean()

        Survived
Sex
female  0.742038
male    0.188908

In [178]:
#문제28 Pclass별 평균 나이를 구하세요.
titanic_sum[['Pclass','Age']].groupby(['Pclass']).mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

In [179]:
#문제29 'Age'에10을 더한 값을 새로운 컬럼 'Age_plus_10'으로 추가하세요
titanic_sum['Age_plus_10'] = titanic_sum['Age']+10

In [180]:
#문제30
titanic_sum['나이분류'] = np.where(titanic_sum['Age'] >= 18,'성인','미성년')
titanic_sum

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived,Age_plus_10,나이분류
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,None,S,0,32.0,성인
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1,48.0,성인
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,None,S,1,36.0,성인
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1,45.0,성인
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,None,S,0,45.0,성인
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,None,S,0,37.0,성인
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1,29.0,성인
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,3,23.4500,None,S,0,NaN,미성년
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1,36.0,성인
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,None,Q,0,42.0,성인

In [181]:
#문제31 'Age'의 결측치를 평균으로 채우세요
titanic_sum['Age'].isna()
titanic_sum['Age'] = titanic_sum['Age'].fillna(29)

In [182]:
#문제32 'Cabin'컬럼의 결측치를 'Unknown'으로 채우세요.
titanic_sum['Cabin'].isna()
titanic_sum['Cabin'] =titanic_sum['Cabin'].fillna('Unknown')

In [183]:
#문제33 중복된'Ticket'값을 제거하고 몇 개가 남는지 출력하세요.
titanic_sum['Ticket'].drop_duplicates()

0             A/5 21171
1              PC 17599
2      STON/O2. 3101282
3                113803
4                373450
             ...
884     SOTON/OQ 392076
886              211536
887              112053
889              111369
890              370376
Name: Ticket, Length: 681, dtype: object

In [184]:
#문제34 'Embarked'컬러의 고유값과 각각의 개수를 출력하세요.
titanic_sum['Embarked'].value_counts(sort=False)

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [185]:
#문제35 인덱스를 'PassengerId'로 설정하세요
titanic_sum.set_index(['PassengerId'])

,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived,Age_plus_10,나이분류
PassengerId,,,,,,,,,,,,,
1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,Unknown,S,0,32.0,성인
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1,48.0,성인
3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,Unknown,S,1,36.0,성인
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1,45.0,성인
5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,Unknown,S,0,45.0,성인
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,Unknown,S,0,37.0,성인
888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1,29.0,성인
889,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,3,23.4500,Unknown,S,0,NaN,미성년
890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1,36.0,성인
891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,Unknown,Q,0,42.0,성인

In [187]:
#문제36 인데스를 초기화하세요
titanic_sum.reset_index(drop=True)

,PassengerId,Name,Sex,Age,SibSp,Parch,Ticket,Pclass,Fare,Cabin,Embarked,Survived,Age_plus_10,나이분류
0,1,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,3,7.2500,Unknown,S,0,32.0,성인
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,1,71.2833,C85,C,1,48.0,성인
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,3,7.9250,Unknown,S,1,36.0,성인
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,1,53.1000,C123,S,1,45.0,성인
4,5,"Allen, Mr. William Henry",male,35.0,0,0,373450,3,8.0500,Unknown,S,0,45.0,성인
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,0,0,211536,2,13.0000,Unknown,S,0,37.0,성인
887,888,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,1,30.0000,B42,S,1,29.0,성인
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,3,23.4500,Unknown,S,0,NaN,미성년
889,890,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,1,30.0000,C148,C,1,36.0,성인
890,891,"Dooley, Mr. Patrick",male,32.0,0,0,370376,3,7.7500,Unknown,Q,0,42.0,성인

In [189]:
#문제37 성별과pclass의 생존률을 피벗 테이블로 만드세요.
titanic_sum.pivot_table(values='Survived',index='Sex',columns = 'Pclass')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [191]:
#문제38 groupby()를 사용하여 각 성별의 평균 나이를 구하세요
titanic_sum[['Sex','Age']].groupby(['Sex']).mean()

              Age
Sex
female  28.098726
male    30.355581

In [205]:
#39 전체승객의 평균 생존율을 구하세요
len(titanic_sum[titanic_sum['Survived']==1])/len(titanic_sum['PassengerId'])

0.3838383838383838

In [226]:
#40 25세 이하 승객의 생존율을 구하세요
titanic_sum[titanic_sum['Age'] <= 25]['Survived'].mean()*100

np.float64(41.19601328903654)

In [227]:
#41 남성의 생존율을 구하세요
titanic_sum[titanic_sum['Sex'] == 'male']['Survived'].mean()*100

np.float64(18.890814558058924)

In [228]:
#41 여성의 생존율을 구하세요
titanic_sum[titanic_sum['Sex'] == 'female']['Survived'].mean()*100

np.float64(74.20382165605095)

In [229]:
#문제42 생존율을 구하는 함수가 작성되어 있습니다. 성별 생존율을 groupby를 활용해 구하기 위해 ?부분을 알맞게 채워주세요.
def survival_ratio(survived):
    df.groupby('Sex')['Survived'].apply(survival_ratio)
    return survived.sum() / len(survived)